app/controllers/manager/users_controller.rb

  def index
    @employees = User.employees(@current_user.company_id) if @current_user.company_id.present?
---
SELECT "users".* FROM "users" WHERE (manager='f' and company_id=2)
SELECT COUNT(*) FROM "users" WHERE (manager='f' and company_id=1)

  def create
    @manager = User.new(params[:user])
    @manager.manager = true

    if @manager.save
---
INSERT INTO "users" ("address", "city", "company_id", "created_at", "email", "first_name", "last_name", "latitude", "longitude", "manager", "number", "password", "phone", "type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @employee = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]