app/controllers/checkings_controller.rb

SELECT "checkings".* FROM "checkings" WHERE "checkings"."user_id" = 2 ORDER BY "checkings"."id" DESC LIMIT 1
---
  def new
    if @current_user.checkings.present?

INSERT INTO "checkings" ("checked_in_at", "checked_out_at", "hour_value", "user_id") VALUES (?, ?, ?, ?)  [["checked_in_at", Thu, 01 Aug 2013 19:53:28 UTC +00:00], ["checked_out_at", nil], ["hour_value", nil], ["user_id", 2]]
---
  def create
    if @current_user.location_ok?(params[:checking][:lat].to_f, params[:checking][:lng].to_f)
      @checking = Checking.new(params[:checking])
      @checking.user_id = @current_user.id
      @checking.checked_in_at = Time.now
      @checking.hour_value = @current_user.hour_value
      @checking.approved = false

      if @checking.save

SELECT "checkings".* FROM "checkings" WHERE (user_id=2 and checked_out_at=NULL) ORDER BY "checkings"."id" DESC LIMIT 1
SELECT "checkings".* FROM "checkings" WHERE "checkings"."user_id" = 2 AND "checkings"."checked_out_at" IS NULL ORDER BY "checkings"."id" DESC LIMIT 1
UPDATE "checkings" SET "checked_out_at" = '2013-08-01 20:36:38.848190' WHERE "checkings"."id" = 17
---
  def update

    if @current_user.location_ok?(params[:checking][:lat].to_f, params[:checking][:lng].to_f)
      @checking = @current_user.checkings.last
      @checking.checked_out_at = Time.now
      @checking.set_value

      if @checking.update_attributes(checked_out_at: Time.now, value: @checking.value)