app/controllers/companies_controller.rb

  def create
    @company = Company.new(params[:company])

    if @company.save
---
INSERT INTO "companies" ("cnpj", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["cnpj", 12345678901], ["created_at", Fri, 09 Aug 2013 12:20:25 UTC +00:00], ["name", "UNIP"], ["updated_at", Fri, 09 Aug 2013 12:20:25 UTC +00:00]]

  def set_company_to_current_user
    @current_user.update_attribute(:company_id, @company.id)
---
UPDATE "users" SET "company_id" = NULL, "updated_at" = '2013-08-09 13:01:05.518609' WHERE "users"."id" = 3