app/controllers/login_controller.rb

SELECT "users".* FROM "users" WHERE (email='gui.teo2@gmail.com' and password='806003aa0ad2e884b7d148de2fea9373d0d13d62') LIMIT 1
---
  def login
    if request.post?
      email = params[:email]
      password = params[:password]
      if email.blank? && password.blank?
        flash[:notice] = "Invalid email or password"
        return
      end
      if email.blank?
        flash[:notice] = "Invalid email"
        return
      end
      if password.blank?
        flash[:notice] = "Invalid password"
        return
      end
      user = User.authenticate(email, password)
      p user
      if user.nil?
        flash[:notice] = "Invalid email or password"
        return
      end
      session[:id] = user.id
      session[:name] = "#{user.first_name} #{user.last_name}"