app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @employee = User.find(params[:id])

INSERT INTO "users" ("address", "city", "company_id", "created_at", "email", "first_name", "last_name", "latitude", "longitude", "manager", "number", "password", "phone", "type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @employee = User.new(params[:user])
    @employee.manager = false
    @employee.company_id = @current_user.company_id

    if @employee.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @employee = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "address" = 'Santa Maria', "number" = 222, "city" = 'Andradina', "updated_at" = '2013-08-12 03:30:15.587687' WHERE "users"."id" = 2
---
  def update
    @employee = User.find(params[:id])

    if @employee.update_attributes(params[:user])